controllers/CustomersController.php

    public function actionGetCustomers()
    {
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $customers = Customers::find()->all();
---
SELECT * FROM `customers`

    public function actionUpdateCustomers()
    {
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $attributes = \yii::$app->request->post();

        $customers = Customers::find()->where(['id' => $attributes['id'] ])->one();
---
SELECT * FROM `customers` WHERE `id`='1'